n0_dict = {1: 'один', 2: 'два', 3: 'три', 4: 'четыре', 5: 'пять',
           6: 'шесть', 7: 'семь', 8: 'восемь', 9: 'девять'}
n1_dict = {10: 'десять', 11: 'одиннадцать', 12: 'двенадцать', 13: 'тринадцать',
           14: 'четырнадцать', 15: 'пятнадцать', 16: 'шестнадцать',
           17: 'семнадцать', 18: 'восемнадцать', 19: 'девятнадцать'}
n2_dict = {10: 'десять', 20: 'двадцать', 30: 'тридцать', 40: 'сорок', 50: 'пятьдесят',
           60: 'шестьдесят', 70: 'семьдесят', 80: 'восемьдесят', 90: 'девяносто'}
n3_dict = {100: 'сто', 200: 'двести', 300: 'триста', 400: 'четыреста', 500: 'пятьсот',
           600: 'шестьсот', 700: 'семьсот', 800: 'восемьсот', 900: 'девятьсот'}
n=input('write number from 1 to 999')
while not n.isdigit():
    n=input('write number from 1 to 999 again')
n=int(n)
first_word = ''
second_word = ''
third_word = ''
if (n//100)*100 in n3_dict:
    first_word = n3_dict[(n//100)*100]
if n%100 in n1_dict:
    second_word = n1_dict[n%100]
else:
    if ((n%100)//10)*10 in n2_dict:
        second_word = n2_dict[((n%100)//10)*10]
    if n%10 in n0_dict:
        third_word = n0_dict[n%10]
print(f'{first_word} {second_word} {third_word}')